In [2]:
import sqlite3
import pandas as pd
import numpy as np

Подключение к базе данных, или если ее нет создание и подключение

In [5]:
con = sqlite3.connect('orders.db')

In [24]:
df = pd.read_csv(r'C:\Users\Ilya\Desktop\german_credit_data.csv', index_col='Unnamed: 0')
df.columns = ['age', 'sex', 'job', 'housing', 'saving_accounts', 'checking_account',
              'credit_amount', 'duration', 'purpose']
df

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose
0,67,male,2,own,NaN,little,1169,6,radio/TV
1,22,female,2,own,little,moderate,5951,48,radio/TV
2,49,male,1,own,little,NaN,2096,12,education
3,45,male,2,free,little,little,7882,42,furniture/equipment
4,53,male,2,free,little,little,4870,24,car
...,...,...,...,...,...,...,...,...,...
995,31,female,1,own,little,NaN,1736,12,furniture/equipment
996,40,male,3,own,little,little,3857,30,car
997,38,male,2,own,little,NaN,804,12,radio/TV
998,23,male,2,free,little,little,1845,45,radio/TV
999,27,male,2,own,moderate,moderate,4576,45,car

Заливка таблицы в базу данных к которой подключены

In [25]:
df.to_sql(name='german_credit', con=con, schema='public', if_exists='replace')

In [7]:
# функция-обертка
def select_data(sql):
    return pd.read_sql(sql, con)

In [12]:
sql_query = '''
select * from german_credit;
'''

In [28]:
sql_query = '''
select count(*)
from german_credit
where checking_account is null;
'''

In [29]:
select_data(sql_query)

   count(*)
0       394

In [63]:
df3 = pd.DataFrame([[1, 2, 1], [2, 2, 1], [1, 5, 1]], columns=['col1', 'col2', 'col3'])
df3

   col1  col2  col3
0     1     2     1
1     2     2     1
2     1     5     1

In [64]:
df3.to_sql('df3', con, index=False, if_exists='replace')

In [65]:
sql = '''
select * from df3;
'''

In [66]:
pd.read_sql(sql, con)

   col1  col2  col3
0     1     2     1
1     2     2     1
2     1     5     1

In [85]:
sql = '''
select group_credit, avg(credit_amount) as avg_credit
from (SELECT credit_amount,
       CASE
           WHEN credit_amount <2000 THEN '1. <9000'
           ELSE '2. >9000'
       END as group_credit
      FROM german_credit)
group by group_credit
order by avg_credit;
'''

In [79]:
sql = '''
select max(credit_amount) from german_credit;
'''

In [86]:
pd.read_sql(sql, con)

  group_credit   avg_credit
0     1. <9000  1266.835648
1     2. >9000  4795.748239